insert into category(id, name, parent_id, depth)
values (1, '상의', null, 0),
       (2, '아우터', null, 0),
       (3, '바지', null, 0),
       (4, '원피스', null, 0),
       (5, '스커트', null, 0),
       (6, '스니커즈', null, 0),
       (7, '신발', null, 0),
       (8, '가방', null, 0),
       (9, '여성 가방', null, 0),
       (10, '스포츠/용품', null, 0),
       (11, '모자', null, 0),
       (12, '양말/레그웨어', null, 0),

       -- 1-1
       (13, '후드 티셔츠', 1, 1),
       (14, '긴소매 티셔츠', 1, 1),
       (15, '피케/카라 티셔츠', 1, 1),
       (16, '민소매 티셔츠', 1, 1),
       (17, '니트/스웨터', 1, 1),
       (18, '맨투맨/스웨트셔츠', 1, 1),
       (19, '셔츠/블라우스', 1, 1),
       (20, '반소매 티셔츠', 1, 1),
       (21, '스포츠 상의', 1, 1),
       (22, '기타 상의', 1, 1),

       -- 2-1
       (23, '블루종/MA-1', 2, 1),
       (24, '무스탕/퍼', 2, 1),
       (25, '슈트/블레이저 재킷', 2, 1),
       (26, '아노락 재킷', 2, 1),
       (27, '트레이닝 재킷', 2, 1),
       (28, '환절기 코드', 2, 1),
       (29, '겨울 더블 코트', 2, 1),
       (30, '롱패딩/롱헤비 아우터', 2, 1),
       (31, '패딩 베스트', 2, 1),
       (32, '사파리/헌팅 재킷', 2, 1),
       (33, '후드 집업', 2, 1),
       (34, '레더/라이더스 재킷', 2, 1),
       (35, '트리커 재킷', 2, 1),
       (36, '카디건', 2, 1),
       (37, '폴리스/뽀글이', 2, 1),
       (38, '스타디움 재킷', 2, 1),

       -- 3-1
       (39, '코튼 팬츠', 3, 1),
       (40, '트레이닝/조거 팬츠', 3, 1),
       (41, '레깅스', 3, 1),
       (42, '데님 팬츠', 3, 1),
       (43, '슈트 팬츠/슬랙스', 3, 1),
       (44, '점프 슈트/오버올', 3, 1),
       (45, '기타 바지', 3, 1),

       -- 3-1-1
       (46, '특별 코튼팬츠', 39, 2),
       (47, '특별 트레이닝/조거 팬츠', 40, 2),
       (48, '특별 레깅스', 41, 2),
       (49, '특별 데님 팬츠', 42, 2),
       (50, '특별 슈트 팬츠/슬랙스', 43, 2),
       (51, '특별 점프 슈트/오버올', 44, 2),
       (52, '특별 기타 바지', 45, 2);


